{
    "content": {
        "signup": "Please use this page to sign up. Once signed in you will be able to save your own links, and view them on the user details page. Currently you are restricted to Guest login only.",
        "welcome": "Welcome to the Learn Space application. The application makes use of the NASA Video and Image API. The application allows keyword searches. Results are limited to 10 currently per search. It is also possible to save links and review them on the user details page.",
        "about_copyright": "This application makes use of the NASA Open API for images. Content is allowed to be displayed under Nasa Copyright. Users are signed in as Guest and can update the guest log in details",
        "about_discover": "The discover page, has a default search option when it loads. Users can update the search term and search NASA image and video archives. At the moment for performance the first 10 hits are displayed. It is possible to 'save details'. The url and title will then be available on the user details page for future reference / export.",
        "about_topics":"The topics page provides various links by subject area of interest to NASA resources on the NASA home page.",
        "about_links": "The links page provides 4 different cards of interest. This will be expanded on later in the next phase of the project.",
        "about_secured": "The secured page is only visible if keycloak is running and the user has logged in with the correct credentials. The username/password and authentication have yet to be intergrated, hence we we just make use of a default guest log in. This will be integrated in a future phase.",
        "about signup": "The user may enter their details. Currently until integration with keycloak is enabled, the user is logged in as Guest. They can however update their user details via this page.",
        "about_user_details": "The user details page, displays the current Guest user details, along with any links that that have been selected from the Discover page during searching."
    },
    "cardcontent": [
        {"id": "1",
         "title": "Robonaut 2",
         "subheader": "March 19, 2021",
         "content1": "A Robonaut is a dexterous humanoid robot built and designed at NASA Johnson Space Center in Houston, Texas. Our challenge is to build machines that can help humans work and explore in space. Working side by side with humans, or going where the risks are too great for people.",
         "content2": "Researchers at NASA's Johnson Space Center (JSC), in collaboration with General Motors and Oceaneering, have designed a state-of-the-art, highly dexterous, humanoid robot: Robonaut 2 (R2). R2 is made up of multiple component technologies and systems -- vision systems, image recognition systems, sensor integrations, tendon hands, control algorithms, and much more. R2's nearly 50 patented and patent-pending technologies have the potential to be game-changers in multiple industries, including logistics and distribution, medical and industrial robotics, and beyond.",
         "content3": "The Robonaut project has been conducting research in robotics technology on board the International Space Station (ISS) since 2012 (more on R2 in the ISS). Recently, the original upper body humanoid robot was upgraded by the addition of two climbing manipulators ('legs'), more capable processors, and new sensors. While Robonaut 2 (R2) has been working through checkout exercises on orbit following the upgrade, technology development on the ground has continued to advance. Through the Active Reduced Gravity Offload System (ARGOS), the Robonaut team has been able to develop technologies that will enable full operation of the robotic testbed on orbit using similar robots located at the Johnson Space Center. Once these technologies have been vetted in this way, they will be implemented and tested on the R2 unit on board the ISS. The goal of this work is to create a fully-featured robotics research platform on board the ISS to increase the technology readiness level of technologies that will aid in future exploration missions.",
         "content4": "One advantage of a humanoid design is that Robonaut can take over simple, repetitive, or especially dangerous tasks on places such as the International Space Station. Because R2 is approaching human dexterity, tasks such as changing out an air filter can be performed without modifications to the existing design.",
         "content5":  "Another way this might be beneficial is during a robotic precursor mission. R2 would bring one set of tools for the precursor mission, such as setup and geologic investigation. Not only does this improve efficiency in the types of tools, but also removes the need for specialized robotic connectors. Future missions could then supply a new set of tools and use the existing tools already on location.",
         "image": "http://localhost:8080/getstaticimage/robonaut2.jpg"
        },
        {"id": "2",
         "title": "Mars Helicopter",
         "subheader": "March 19, 2021",            
         "content1": "The helicopter, which weighs about 4 pounds (1.8 kilograms) on Earth and has a fuselage about the size of a tissue box, started out six years ago as an implausible prospect. Engineers at NASA’s Jet Propulsion Laboratory in Southern California knew it was theoretically possible to fly in Mars’ thin atmosphere, but no one was sure whether they could build a vehicle powerful enough to fly, communicate, and survive autonomously with the extreme restrictions on its mass.",
         "content2": "Then the team had to prove in Earthbound tests that it could fly in a Mars-like environment. Now that they’ve checked off those objectives, the team is preparing to test Ingenuity in the actual environment of Mars.",
         "content3": "Our Mars Helicopter team has been doing things that have never been done before – that no one at the outset could be sure could even be done,” said MiMi Aung, the Ingenuity project manager at JPL “We faced many challenges along the way that could have stopped us in our tracks. We are thrilled that we are now so close to demonstrating – on Mars – what Ingenuity can really do.",
         "content4": "Ingenuity survived the intense vibrations of launch on July 30, 2020, and has passed its health checks as it waits to plunge with Perseverance through the Martian atmosphere. But the helicopter won’t attempt its first flight for more than a month after landing: Engineers for the rover and helicopter need time to make sure both robots are ready",
         "content5":  "The Mars Helicopter is what is known as a technology demonstration – a narrowly focused project that seeks to test a new capability for the first time. Previous groundbreaking technology demonstrations include the first Mars rover, Sojourner, and the Mars Cube One (MarCO) CubeSats that flew by Mars.",
         "image": "http://localhost:8080/getstaticimage/marscopter.jpg"
        },
        {"id": "3",
         "title": "Artemis",
         "subheader": "March 19, 2021",                
         "content1": "America is going back to the Moon, and NASA will use what it learns during the Artemis program to prepare for humanity's next giant leap: sending astronauts to Mars. Artemis is part of the steppingstone approach that will build on research conducted in ground analogs and on the International Space Station to help NASA identify ways to keep astronauts safe, healthy, and productive during future missions to Mars.",
         "content2": "Round-trip missions to Mars are expected to take up to three years, and engineers and scientists at NASA’s Human Research Program, or HRP, seek to better understand what might happen to the human body during that time. The research gathered throughout analog, space station, and Artemis missions aims to examine the risks astronauts will encounter on long missions far from Earth. Additionally, the studies provide insight into how humans adapt or respond to those risks, and how to develop effective ways to counter any negative effects.",
         "content3": "art of Artemis is the Gateway, which will be an outpost that orbits the Moon and provides vital support for a sustainable, long-term human presence on the lunar surface, as well as a staging point for deep space exploration. As NASA and its partners build the Gateway, the outpost’s capabilities will expand to include more living and research space, enabling months-long crew expeditions with multiple trips down to the lunar surface.",
         "content4": "The Gateway provides the platform that enables all types of testing and training for Mars missions,” said Kris Lehnhardt, element scientist for Exploration Medical Capability for HRP at NASA’s Johnson Space Center in Houston. “The platform can be designed from the very beginning to be as similar to an exploration environment as possible, while decreasing Earth dependence for future missions.",
         "content5": "Missions to the Moon are about 1,000 times farther from Earth and more challenging than expeditions to the space station. Artemis missions will provide a unique opportunity to evaluate the hazards astronauts will face in a true deep space environment, before embarking on the years-long journey to Mars. Lunar missions will enable researchers to address the challenges of living farther from Earth than ever before, and test new technologies and procedures needed for the approximately 140 million mile round-trip to the Red Planet.",
          "image": "http://localhost:8080/getstaticimage/artemis.jpg"
        },
        {"id": "4",
         "title": "Lucy",
         "subheader": "March 19, 2021",        
         "content1": "Seen here in late 2020 nearly fully assembled, the 13-foot tall (about 4 meters) Lucy spacecraft is lifted back to its dolly as the Lockheed Martin team in Denver, Colorado, continues production.",
         "content2": "Since Lucy will be exploring deep space hundreds of millions of miles away, the 6.5-foot (about 2 meters) in diameter high gain antenna will be critical for communications to and from Earth as the spacecraft visits seven different Trojan asteroids and one main belt asteroid.",
         "content3": "The spacecraft will complete its journey over the course of 12 years, and its many maneuvers will be fueled by the propulsion tanks seen here. ",
         "content4": "Lucy will head to Cape Canaveral Air Force Station this summer for processing ahead of its launch window, which opens Oct. 16, 2021.",
         "content5": "Lucy is so cool",
         "image": "http://localhost:8080/getstaticimage/lucy.jpg"
        }
    ],
    "images": [
       {"id": 1,
        "title": "Aurora Shimmer, Meteor Flash",
        "credit": "Image Credit & Copyright: Bjørnar G. Hansen",
        "description": "Explanation: Some night skies are serene and passive -- others shimmer and flash. The later, in the form of auroras and meteors, haunted skies over the island of Kvaløya, near Tromsø Norway on 2009 December 13. This 30 second long exposure records a shimmering auroral glow gently lighting the wintery coastal scene. A study in contrasts, the image also captures the sudden flash of a fireball meteor from the excellent Geminid meteor shower of 2009. Streaking past familiar stars in the handle of the Big Dipper, the trail points back toward the constellation Gemini, off the top of the view. Both auroras and meteors occur in Earth's upper atmosphere at altitudes of 100 kilometers or so, but aurora caused by energetic charged particles from the magnetosphere, while meteors are trails of cosmic dust. Nine years after this photograph was taken, toward the end of this week, the yearly 2018 Geminids meteor shower will peak again, although this time their flashes will compete with the din of a half-lit first-quarter moon during the first half of the night.",
        "imageurl": "http://localhost:8080/getstaticimage/image1.jpg"
       },
       {"id": 2,
        "title": "Moon Struck",
        "credit": "Image Credit & Copyright: Petr Horálek",
        "description": "Explanation: Craters produced by ancient impacts on the airless Moon have long been a familiar sight. But only since the 1990s have observers began to regularly record and study optical flashes on the lunar surface, likely explosions resulting from impacting meteoroids. Of course, the flashes are difficult to see against a bright, sunlit lunar surface. But during the January 21 total eclipse many imagers serendipitously captured a meteoroid impact flash against the dim red Moon. Found while examining images taken shortly before the total eclipse phase began, the flash is indicated in the inset above, near the Moon's darkened western limb. Estimates based on the flash duration recorded by the Moon Impact Detection and Analysis System (MIDAS) telescopes in southern Spain indicate the impactor's mass was about 10 kilograms and created a crater between seven and ten meters in diameter.",
        "imageurl": "http://localhost:8080/getstaticimage/image2.jpg"
       },
       {"id": 3,
        "title": "NGC 2442: Galaxy in Volans",
        "credit":"Image Credit & Copyright: Processing: Robert Gendler & Roberto Colombari. Data: Hubble Legacy Archive, European Southern Observatory",
        "description": "Explanation: Distorted galaxy NGC 2442 can be found in the southern constellation of the flying fish, (Piscis) Volans. Located about 50 million light-years away, the galaxy's two spiral arms extending from a pronounced central bar have a hook-like appearance in wide-field images. But this mosaicked close-up, constructed from Hubble Space Telescope and European Southern Observatory data, follows the galaxy's structure in amazing detail. Obscuring dust lanes, young blue star clusters and reddish star forming regions surround a core of yellowish light from an older population of stars. The sharp image data also reveal more distant background galaxies seen right through NGC 2442's star clusters and nebulae. The image spans about 75,000 light-years at the estimated distance of NGC 2442.",
        "imageurl": "http://localhost:8080/getstaticimage/image3.jpg"
       }
    ]
}